[
  {
    "qus": "Shauna was killed one Sunday morning. The police know who they are going to arrest from this bit of information:",
    "quotes": [
      "April was getting the mail.",
      "Alyssa was doing laundry.",
      "Reggie was cooking.",
      "Mark was planting in the garden."
    ],
    "ans": "April was getting the mail.",
    "explain": "April killed Shauna because there is no mail delivery on Sundays."
  },
  {
    "qus": "A Japanese ship was en route in the open sea. The Japanese captain went for a shower removing his diamond ring and Rolex watch on the table. When he returned, his valuables were missing. The captain immediately called the five suspected crew members and asked each one where and what he was doing for the last 15 minutes.",
    "quotes": [
      "The Filipino cook in a heavy overcoat said, `I was in fridge room getting meat for cooking`.",
      "The Indian Engineer with a torch in hand said, `I was working on generator engine.`",
      "The Sri Lankan seaman said, `I was on the mast (top of the ship) correcting the flag which was upside down by mistake`"
    ],
    "ans": "The Sri Lankan seaman said, `I was on the mast (top of the ship) correcting the flag which was upside down by mistake`",
    "explain": "The thief is the Sri Lankan seaman. They are on a Japanese ship, so it will bear a Japanese flag. The Japanese flag will look the same upside down."
  },
  {
    "qus": "A game set has gone missing from the classroom. Mr Robert called up 4 pupils and interviewed them. Only one of them is telling the truth.",
    "quotes": [
      "Alice: I did not take the game set",
      "David: I think Bob took the game set.",
      "Bob: Alice is lying.",
      "Carol: Bob is lying."
    ],
    "ans": "Bob: Alice is lying.",
    "explain": "Alice took the game set and Bob is telling the truth."
  },
  {
    "qus": "The Smith family is a very wealthy family that lives in a big, circular home. One morning, Mr. Smith woke up and saw a strawberry jam stain on his new carpet. He figured out that everyone who was there that morning had a jam sandwich.",
    "quotes": [
      "Billy Smith: I was outside playing basketball.",
      "The Maid: I was dusting the corners of the house.",
      "Chef: I was starting to make lunch for later."
    ],
    "ans": "The Maid: I was dusting the corners of the house.",
    "explain": "The maid was lying. There are no corners in a circular house."
  },
  {
    "qus": "It was the first day of school when a young girl was found dead in the classroom. Police had identified four suspects.",
    "quotes": [
      "The Dean claimed that he was in his office the whole day.",
      "The Maths teacher claimed that she was giving the midterm exam results to her students.",
      "The clerk claimed that he was bringing the mails.",
      "The janitor claimed that he was cleaning the toilet on the first floor."
    ],
    "ans": "The Maths teacher claimed that she was giving the midterm exam results to her students.",
    "explain": "The Maths teacher was lying. She cannot be giving the midterm exam results on the first day of school."
  },
  {
    "qus": "A rich and handsome man named James Leonard was murdered on a Sunday afternoon. At the time of the murder there was: the maid, the cook, the butler and the wife. They gave the following statements.",
    "quotes": [
      "Maid: I was fixing the table.",
      "Cook: I was cooking breakfast.",
      "Butler: I was polishing the silverware and the dishes.",
      "Wife: I was reading a book."
    ],
    "ans": "Cook: I was cooking breakfast.",
    "explain": "The cook did it. You don’t cook breakfast in the afternoon."
  },
  {
    "qus": "A man was killed in his office. At the time of murder there were only four people in the office: Bill, Tom, Harry and Mike. After analysis, the police found out that only one person was telling the truth and the rest were lying. Who is telling the truth?",
    "quotes": [
      "Bill: Tom did it.",
      "Tom: “Bill did it.",
      "Harry: “Tom’s telling the truth.",
      "Mike: “Harry’s not lying."
    ],
    "ans": "Tom: “Bill did it.",
    "explain": "Tom is the killer and Bill spoke the truth.If Bill was the killer, both Tom and Harry will be telling the truth.If Harry was the killer, none of the statements will be true. If Mike was the killer, none of the statements will be true."
  },
  {
    "qus": "An old man ankit lives alone in a flat. On Friday while delivering the mail , the postman saw the old man dead. CID arrived the scene. On the outside of flat , he found some delivery items. Who is the murderer.",
    "quotes": [
      "The postman: some unopened mails, some gifts",
      "The newspaper deliver: Tuesday newspaper",
      "The milk deliver: two bottles of warm milk"
    ],
    "ans": "The newspaper deliver: Tuesday newspaper",
    "explain": "Newspaper delivery man was the murderer because of absence of Wednesday and Thursday missing newspaper. This indicates he already know that there is no one to read it."
  },
  {
    "qus": "Three spies, suspected as double agents, speak as follows when questioned:",
    "quotes": [
      "Albert: Bertie is a mole.",
      "Bertie: Cedric is a mole.",
      "Cedric: Bertie is lying."
    ],
    "ans": "Bertie: Cedric is a mole.",
    "explain": "When Albert said, “Bertie is a mole,” he was telling the truth, and giving the correct answer. When Bertie said, “Cedric is a mole,” he was lying, as he himself is a lying mole. When Cedric responded, “Bertie is lying,” he was telling the truth, and also affirming that Bertie was lying."
  }
]